{
  "intents": [
    {
      "tag": "ws_event_time",
      "patterns": [
        "What time is the welcome speech happening?",
        "When does the welcome speech take place?",
        "What is the timing for the welcome speech?"
      ],
      "responses": [
        "The Welcome Speech is scheduled for 16 January 2025, from 07:00 PM to 08:30 PM."
      ]
    },
    {
      "tag": "ws_venue_location",
      "patterns": [
        "Where will the welcome speech be held?",
        "What is the venue for the welcome speech?",
        "Can you tell me where the event is?"
      ],
      "responses": [
        "The Welcome Speech will take place at Block C, James Cook University Singapore."
      ]
    },
    {
      "tag": "ws_speakers_list",
      "patterns": [
        "Who are the speakers at the welcome speech?",
        "Can you tell me who will be speaking at the welcome speech?",
        "Who will be presenting the welcome speech?"
      ],
      "responses": [
        "The Welcome Speech will be presented by the Deputy Vice-Chancellor of Singapore, and the Acting Campus Dean & Head of Learning, Teaching & Student Engagement."
      ]
    },
    {
      "tag": "ws_event_schedule",
      "patterns": [
        "What is the schedule for the welcome speech event?",
        "Can you share the timeline for the welcome speech?",
        "What is the detailed schedule for the welcome speech?"
      ],
      "responses": [
        "The Welcome Speech Schedule is as follows:\n07:00 PM – 07:10 PM: Welcome Speech by the Deputy Vice-Chancellor of Singapore\n07:10 PM – 07:20 PM: Welcome Speech by the Acting Campus Dean & Head of Learning, Teaching & Student Engagement\n07:20 PM – 07:25 PM: JCU 101\nProceed to Breakout Rooms"
      ]
    },
    {
      "tag": "ab_briefing_time",
      "patterns": [

        "What time is the Academic Briefing scheduled for?",
        "Can you tell me the time for academic advising?",
        "When does the academic session start?"
      ],
      "responses": [
        "The Academic Briefing will take place on 16 January 2025, from 07:25 PM to 08:30 PM."
      ]
    },
    {
      "tag": "ab_briefing_info",
      "patterns": [
        "Who is conducting the Academic Advising session?",
        "Who will be leading the Academic Briefing?",
        "Who are the instructors for the academic session?"
      ],
      "responses": [
        "The Academic Briefing will be led by:\n- Associate Professor, Counselling\n- Academic Head, Social and Health Sciences\n- Academic Head, Business"
      ]
    },
    {
      "tag": "eligible_courses_list",
      "patterns": [
        "Which courses are available for the Welcome Speech?",
        "What programs are eligible for the Welcome Speech?",
        "What courses can I join for the event?"
      ],
      "responses": [
        "The eligible courses for the Welcome Speech are:\n- Part-Time Diploma of Higher Education (Psychological Science)\n- Part-Time Bachelor of Psychological Science\n- Part-Time Master of Guidance and Counselling\n- Part-Time Business Programs"
      ]
    }
  ]
}